public class Task4 {
    // Дана скобочная последовательность
    // [  (  (  (  )  )  (  )  (  (  )  )  ]  ]
    // 1  2  3  4  5  6  7  8  9  10 11 12 13 14
    // Данная скобочная последовательность не является правильной. Нарушен баланс скобок.
    // Для того, что бы она стала правильной, например, нужно убрать круглую скобку №2, потому что
    // она остается в стеке и для нее нет закрывающей, а так же квадратную скобку №14, потому что для нее в стеке
    // нет открывающей. Можно добавить круглую закрывающую скобку между 6 и 7 элементом и квадратную открывающую скобку
    // перед первым элементом последовательности. Так же если удалить все скобки то скобочная последовательность
    // будет правильной.
}